{"class_name": "Model", "keras_version": "2.2.2", "backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 96, 96, 1], "dtype": "float32", "sparse": false, "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 32, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_1", "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 32, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_2", "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2]}}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 64, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_3", "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 64, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_4", "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2", "strides": [2, 2]}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 128, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_5", "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_6", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 128, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_6", "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_3", "strides": [2, 2]}}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_7", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 256, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_7", "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_8", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 256, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_8", "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_4", "config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_4", "strides": [2, 2]}}, {"inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_9", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 512, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_9", "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_10", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 512, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_10", "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_1", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [2, 2], "data_format": "channels_last", "trainable": true, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [2, 2], "bias_regularizer": null, "name": "conv2d_transpose_1", "bias_constraint": null, "output_padding": null}}, {"inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}], ["conv2d_8", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_1", "config": {"axis": 3, "trainable": true, "name": "concatenate_1"}}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_11", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 256, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_11", "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_12", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 256, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_12", "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_2", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [2, 2], "data_format": "channels_last", "trainable": true, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [2, 2], "bias_regularizer": null, "name": "conv2d_transpose_2", "bias_constraint": null, "output_padding": null}}, {"inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}], ["conv2d_6", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_2", "config": {"axis": 3, "trainable": true, "name": "concatenate_2"}}, {"inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_13", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 128, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_13", "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_14", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 128, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_14", "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_3", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [2, 2], "data_format": "channels_last", "trainable": true, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [2, 2], "bias_regularizer": null, "name": "conv2d_transpose_3", "bias_constraint": null, "output_padding": null}}, {"inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}], ["conv2d_4", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_3", "config": {"axis": 3, "trainable": true, "name": "concatenate_3"}}, {"inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_15", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 64, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_15", "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_16", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 64, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_16", "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_4", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [2, 2], "data_format": "channels_last", "trainable": true, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [2, 2], "bias_regularizer": null, "name": "conv2d_transpose_4", "bias_constraint": null, "output_padding": null}}, {"inbound_nodes": [[["conv2d_transpose_4", 0, 0, {}], ["conv2d_2", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_4", "config": {"axis": 3, "trainable": true, "name": "concatenate_4"}}, {"inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_17", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 32, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_17", "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_18", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "filters": 32, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_regularizer": null, "name": "conv2d_18", "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_19", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "sigmoid", "filters": 1, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "use_bias": true, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_regularizer": null, "name": "conv2d_19", "bias_constraint": null}}], "output_layers": [["conv2d_19", 0, 0]]}}